Revit 2026 API

# IExternalResourceUIServerHandleLoadResourceResults Method

---
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
void HandleLoadResourceResults(
	Document document,
	IList<ExternalResourceLoadData> loadData
)
```
```vb
Sub HandleLoadResourceResults (
	document As Document,
	loadData As IList(Of ExternalResourceLoadData)
)
```
```cpp
void HandleLoadResourceResults(
	Document^ document,
	IList<ExternalResourceLoadData^>^ loadData
)
```
```fsharp
abstract HandleLoadResourceResults :
        document : Document *
        loadData : IList<ExternalResourceLoadData> -> unit
```

#### Parameters

document Document

loadData IListExternalResourceLoadData

#### Reference

IExternalResourceUIServer Interface

Autodesk.Revit.UI Namespace